------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/andres/repositories/am.as1/stata/output/logs/main.log
  log type:  text
 opened on:  14 Sep 2025, 12:26:49

. 
. 
. // load data
. use "$rawdata/income_bmi.dta", clear

. 
. 
. // clean data
. save "$cleandata/income_bmi_clean.dta", replace
file C:/Users/andres/repositories/am.as1/stata/data/clean/income_bmi_clean.dta saved

. 
. 
. // question one
. gen height_m = height / 100

. gen bmi = weight / (height_m^2)
(13 missing values generated)

. 
. gen bmi_cat = .
(460 missing values generated)

. replace bmi_cat = 1 if bmi < 18.5 & !missing(bmi)
(2 real changes made)

. replace bmi_cat = 2 if bmi >= 18.5 & bmi < 25 & !missing(bmi)
(99 real changes made)

. replace bmi_cat = 3 if bmi >= 25 & bmi < 30 & !missing(bmi)
(153 real changes made)

. replace bmi_cat = 4 if bmi >= 30 & !missing(bmi)
(193 real changes made)

. 
. // a
. gen overweight = (bmi_cat >= 3) if !missing(bmi_cat)
(13 missing values generated)

. gen obese = (bmi_cat == 4) if !missing(bmi_cat)
(13 missing values generated)

. 
. tab black overweight, row missing

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Race: |
     Black |
   (1=Yes, |            overweight
     0=No) |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |        87        296         11 |       394 
           |     22.08      75.13       2.79 |    100.00 
-----------+---------------------------------+----------
         1 |        13         50          2 |        65 
           |     20.00      76.92       3.08 |    100.00 
-----------+---------------------------------+----------
         . |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |       101        346         13 |       460 
           |     21.96      75.22       2.83 |    100.00 

. tab black obese, row missing

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Race: |
     Black |
   (1=Yes, |              obese
     0=No) |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |       225        158         11 |       394 
           |     57.11      40.10       2.79 |    100.00 
-----------+---------------------------------+----------
         1 |        28         35          2 |        65 
           |     43.08      53.85       3.08 |    100.00 
-----------+---------------------------------+----------
         . |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |       254        193         13 |       460 
           |     55.22      41.96       2.83 |    100.00 

. 
. tabout black overweight using "$tables/tab_black_overweight.tex", ///
>     replace ///
>     c(freq row) ///
>     f(0c 1p) ///
>     style(tex) ///
>     bt ///
>     mi ///
>     topstr(\begin{tabular}{lcccccccc} \toprule) ///
>     botstr(\bottomrule \end{tabular})

Table output written to: C:/Users/andres/repositories/am.as1/stata/output/tables/tab_black_overweight.
> tex

 & \multicolumn{8}{c}{overweight} \\
Race: Black (1=Yes, 0=No) & \multicolumn{2}{c}{0} & \multicolumn{2}{c}{1} & \multicolumn{2}{c}{.} & \m
> ulticolumn{2}{c}{Total} \\
&No.&\%&No.&\%&No.&\%&No.&\% \\
\midrule
0&87&22.1\%&296&75.1\%&11&2.8\%&394&100.0\% \\
1&13&20.0\%&50&76.9\%&2&3.1\%&65&100.0\% \\
.&1&100.0\%&0&0.0\%&0&0.0\%&1&100.0\% \\
Total&101&22.0\%&346&75.2\%&13&2.8\%&460&100.0\% \\

. 
. tabout black obese using "$tables/tab_black_obese.tex", ///
>     replace ///
>     c(freq row) ///
>     f(0c 1p) ///
>     style(tex) ///
>     bt ///
>     mi ///
>     topstr(\begin{tabular}{lcccccccc} \toprule) ///
>     botstr(\bottomrule \end{tabular})

Table output written to: C:/Users/andres/repositories/am.as1/stata/output/tables/tab_black_obese.tex

 & \multicolumn{8}{c}{obese} \\
Race: Black (1=Yes, 0=No) & \multicolumn{2}{c}{0} & \multicolumn{2}{c}{1} & \multicolumn{2}{c}{.} & \m
> ulticolumn{2}{c}{Total} \\
&No.&\%&No.&\%&No.&\%&No.&\% \\
\midrule
0&225&57.1\%&158&40.1\%&11&2.8\%&394&100.0\% \\
1&28&43.1\%&35&53.8\%&2&3.1\%&65&100.0\% \\
.&1&100.0\%&0&0.0\%&0&0.0\%&1&100.0\% \\
Total&254&55.2\%&193&42.0\%&13&2.8\%&460&100.0\% \\

. 
. // b
. hist income, by(black) ///
>     title("Income Distribution by Ethnic Group") ///
>     xtitle("Household Income (Euros)") ///
>     percent

. 
. graph box income, over(black) ///
>         title("Income Distribution by Ethnic Group") ///
>         ytitle("Household Income (Euros)")

.         
. // c
. gen bmi_miss = missing(bmi)

. tab black bmi_miss, row missing

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Race: |
     Black |
   (1=Yes, |       bmi_miss
     0=No) |         0          1 |     Total
-----------+----------------------+----------
         0 |       383         11 |       394 
           |     97.21       2.79 |    100.00 
-----------+----------------------+----------
         1 |        63          2 |        65 
           |     96.92       3.08 |    100.00 
-----------+----------------------+----------
         . |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |       447         13 |       460 
           |     97.17       2.83 |    100.00 

. 
. // d
. sum income

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      income |        460    41301.74    39205.63        400     200000

. 
. 
. // question two
. reg income bmi black, robust

Linear regression                               Number of obs     =        446
                                                F(2, 443)         =       1.01
                                                Prob > F          =     0.3650
                                                R-squared         =     0.0045
                                                Root MSE          =      39219

------------------------------------------------------------------------------
             |               Robust
      income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         bmi |  -250.7042   273.3932    -0.92   0.360    -788.0131    286.6046
       black |  -5582.002   5067.197    -1.10   0.271    -15540.73    4376.729
       _cons |    49779.1   8858.698     5.62   0.000      32368.8    67189.39
------------------------------------------------------------------------------

. 
. // c
. quietly sum income

. scalar mean_income = r(mean)

. scalar black_coeff = _b[black]

. 
. display "Mean income: $" mean_income
Mean income: $41301.739

. display "Black coefficient: $" black_coeff  
Black coefficient: $-5582.0022

. display "Ratio: " (black_coeff/mean_income)*100 "%"
Ratio: -13.515175%

. 
. 
. // question three
. 
. // b
. gen bmi2 = bmi^2
(13 missing values generated)

. reg income bmi bmi2 black, robust

Linear regression                               Number of obs     =        446
                                                F(3, 442)         =       1.31
                                                Prob > F          =     0.2702
                                                R-squared         =     0.0058
                                                Root MSE          =      39238

------------------------------------------------------------------------------
             |               Robust
      income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         bmi |   1315.922   1863.338     0.71   0.480    -2346.182    4978.026
        bmi2 |  -24.65731   27.59566    -0.89   0.372    -78.89232    29.57771
       black |  -5251.097   5079.423    -1.03   0.302    -15233.92    4731.725
       _cons |   25943.84   30686.57     0.85   0.398    -34365.88    86253.56
------------------------------------------------------------------------------

. 
. 
. // question four
. gen ln_income = ln(income)

. 
. // b
. reg ln_income i.bmi_cat black, robust

Linear regression                               Number of obs     =        446
                                                F(4, 441)         =       0.76
                                                Prob > F          =     0.5524
                                                R-squared         =     0.0056
                                                Root MSE          =     1.3338

------------------------------------------------------------------------------
             |               Robust
   ln_income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     bmi_cat |
          2  |   .8502523   .7491627     1.13   0.257    -.6221206    2.322625
          3  |   1.030461    .742278     1.39   0.166    -.4283806    2.489303
          4  |   1.008855   .7365706     1.37   0.171    -.4387696     2.45648
             |
       black |  -.0659099   .1718327    -0.38   0.701    -.4036226    .2718027
       _cons |   9.099454    .735465    12.37   0.000     7.654002    10.54491
------------------------------------------------------------------------------

. 
. // d
. reg income i.bmi_cat##i.black

      Source |       SS           df       MS      Number of obs   =       446
-------------+----------------------------------   F(7, 438)       =      1.18
       Model |  1.2666e+10         7  1.8095e+09   Prob > F        =    0.3129
    Residual |  6.7178e+11       438  1.5338e+09   R-squared       =    0.0185
-------------+----------------------------------   Adj R-squared   =    0.0028
       Total |  6.8445e+11       445  1.5381e+09   Root MSE        =     39163

-------------------------------------------------------------------------------
       income | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
      bmi_cat |
           2  |   21887.21    39390.2     0.56   0.579    -55530.08     99304.5
           3  |   17656.52    39304.8     0.45   0.653    -59592.93    94905.98
           4  |   14704.43    39286.9     0.37   0.708    -62509.84     91918.7
              |
      1.black |     -22000   55385.07    -0.40   0.691    -130853.5    86853.54
              |
bmi_cat#black |
         2 1  |  -8737.209   56684.68    -0.15   0.878      -120145    102670.6
         3 1  |   21503.48   56399.21     0.38   0.703    -89343.24    132350.2
         4 1  |   24124.14   55866.23     0.43   0.666    -85675.05    133923.3
              |
        _cons |      25000   39163.16     0.64   0.524    -51971.08    101971.1
-------------------------------------------------------------------------------

. 
. 
. // question seven
. reg bmi income black, robust

Linear regression                               Number of obs     =        446
                                                F(2, 443)         =       1.41
                                                Prob > F          =     0.2450
                                                R-squared         =     0.0078
                                                Root MSE          =     6.3857

------------------------------------------------------------------------------
             |               Robust
         bmi | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      income |  -6.65e-06   6.99e-06    -0.95   0.342    -.0000204    7.09e-06
       black |   1.398679   1.000284     1.40   0.163    -.5672118     3.36457
       _cons |   29.94403   .4524968    66.18   0.000     29.05472    30.83333
------------------------------------------------------------------------------

. 
. 
. // question eight
. ivregress 2sls income (bmi = drinks) black, robust first

First-stage regressions
-----------------------

                                                        Number of obs =    446
                                                        F(2, 443)     =   3.82
                                                        Prob > F      = 0.0227
                                                        R-squared     = 0.0135
                                                        Adj R-squared = 0.0091
                                                        Root MSE      = 6.3673

------------------------------------------------------------------------------
             |               Robust
         bmi | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       black |   1.494908   .9709514     1.54   0.124    -.4133356    3.403151
      drinks |  -.0799125   .0397581    -2.01   0.045    -.1580503   -.0017746
       _cons |   30.03588   .3893374    77.15   0.000      29.2707    30.80105
------------------------------------------------------------------------------


Instrumental variables 2SLS regression            Number of obs   =        446
                                                  Wald chi2(2)    =       3.04
                                                  Prob > chi2     =     0.2190
                                                  R-squared       =          .
                                                  Root MSE        =      58878

------------------------------------------------------------------------------
             |               Robust
      income | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         bmi |   6662.281    4295.35     1.55   0.121     -1756.45    15081.01
       black |  -15524.08   9635.294    -1.61   0.107    -34408.91    3360.745
       _cons |    -155278   127089.9    -1.22   0.222    -404369.7    93813.62
------------------------------------------------------------------------------
Endogenous: bmi
Exogenous:  black drinks

. 
. // c
. estat endogenous

  Tests of endogeneity
  H0: Variables are exogenous

  Robust score chi2(1)            =  5.44532  (p = 0.0196)
  Robust regression F(1,442)      =  6.08207  (p = 0.0140)

. 
end of do-file

. type "$tables/tab_black_overweight.tex"
 & \multicolumn{8}{c}{overweight} \\
Race: Black (1=Yes, 0=No) & \multicolumn{2}{c}{0} & \multicolumn{2}{c}{1} & \multicolumn{2}{c}{.} & \m
> ulticolumn{2}{c}{Total} \\
&No.&\%&No.&\%&No.&\%&No.&\% \\
\midrule
0&87&22.1\%&296&75.1\%&11&2.8\%&394&100.0\% \\
1&13&20.0\%&50&76.9\%&2&3.1\%&65&100.0\% \\
.&1&100.0\%&0&0.0\%&0&0.0\%&1&100.0\% \\
Total&101&22.0\%&346&75.2\%&13&2.8\%&460&100.0\% \\

