------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/andres/repositories/am.as1/stata/output/logs/main.log
  log type:  text
 opened on:  11 Sep 2025, 12:49:53

. 
. 
. // load data
. use "$rawdata/raw.dta", clear

. 
. 
. // clean data
. save "$cleandata/clean.dta", replace
file C:/Users/andres/repositories/am.as1/stata/data/clean/clean.dta saved

. 
. describe

Contains data from C:/Users/andres/repositories/am.as1/stata/data/clean/clean.dta
 Observations:           460                  
    Variables:             5                  11 Sep 2025 12:49
------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------
black           double  %10.0g                Race: Black (1=Yes, 0=No)
income          double  %10.0g                Income of the individual
drinks          double  %10.0g                Consumption of sweetened drinks
height          double  %10.0g                Height in centimeters
weight          double  %10.0g                Weight in kilograms
------------------------------------------------------------------------------------------------------
Sorted by: 

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       black |        459    .1416122    .3490324          0          1
      income |        460    41301.74    39205.63        400     200000
      drinks |        460     4.68913    6.794934          0         40
      height |        460    163.5042    13.32564     144.78     401.32
      weight |        447    79.40904    17.23882   47.62716   145.1494

. 
. // question one
. gen height_m = height / 100

. gen bmi = weight / (height_m^2)
(13 missing values generated)

. 
. gen bmi_cat = .
(460 missing values generated)

. replace bmi_cat = 1 if bmi < 18.5 & !missing(bmi)
(2 real changes made)

. replace bmi_cat = 2 if bmi >= 18.5 & bmi < 25 & !missing(bmi)
(99 real changes made)

. replace bmi_cat = 3 if bmi >= 25 & bmi < 30 & !missing(bmi)
(153 real changes made)

. replace bmi_cat = 4 if bmi >= 30 & !missing(bmi)
(193 real changes made)

. 
. gen overweight = (bmi_cat >= 3) if !missing(bmi_cat)
(13 missing values generated)

. gen obese = (bmi_cat == 4) if !missing(bmi_cat)
(13 missing values generated)

. 
. tab black overweight, row missing

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Race: |
     Black |
   (1=Yes, |            overweight
     0=No) |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |        87        296         11 |       394 
           |     22.08      75.13       2.79 |    100.00 
-----------+---------------------------------+----------
         1 |        13         50          2 |        65 
           |     20.00      76.92       3.08 |    100.00 
-----------+---------------------------------+----------
         . |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |       101        346         13 |       460 
           |     21.96      75.22       2.83 |    100.00 

. tab black obese, row missing

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Race: |
     Black |
   (1=Yes, |              obese
     0=No) |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |       225        158         11 |       394 
           |     57.11      40.10       2.79 |    100.00 
-----------+---------------------------------+----------
         1 |        28         35          2 |        65 
           |     43.08      53.85       3.08 |    100.00 
-----------+---------------------------------+----------
         . |         1          0          0 |         1 
           |    100.00       0.00       0.00 |    100.00 
-----------+---------------------------------+----------
     Total |       254        193         13 |       460 
           |     55.22      41.96       2.83 |    100.00 

. 
. graph box income, over(black)

. hist income, by(black)

. 
. summarize bmi

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        447    29.84949    6.398418   6.477563   49.59922

. tabulate black, summarize(bmi)

Race: Black |
    (1=Yes, |           Summary of bmi
      0=No) |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |   29.662604   6.1815428         383
          1 |   31.100779   7.5109814          63
------------+------------------------------------
      Total |   29.865754   6.3963476         446

. 
. 
. // question two
. reg income bmi black, r

Linear regression                               Number of obs     =        446
                                                F(2, 443)         =       1.01
                                                Prob > F          =     0.3650
                                                R-squared         =     0.0045
                                                Root MSE          =      39219

------------------------------------------------------------------------------
             |               Robust
      income | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         bmi |  -250.7042   273.3932    -0.92   0.360    -788.0131    286.6046
       black |  -5582.002   5067.197    -1.10   0.271    -15540.73    4376.729
       _cons |    49779.1   8858.698     5.62   0.000      32368.8    67189.39
------------------------------------------------------------------------------

. 
end of do-file

